extension/src/InformationRegisters/BarcodeTSD_ПринятыеСессии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>BarcodeTSD_ПринятыеСессии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.BarcodeTSD_СборШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/Documents/BarcodeTSD_СборШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>BarcodeTSD_СборШтрихкодов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

extension/src/HTTPServices/BarcodeTSD/Ext/Module.bsl
// Внешняя система: мобильное приложение Barcode TSD для Android.
// Контракт: POST JSON /v1/barcode/resolve и /v1/barcode-collection-sessions.
// Аутентификация: Basic-аутентификация веб-публикации 1С.
// Требуемая роль: BarcodeTSD_Use.
// Требования: openspec/specs/tsd-product-lookup/spec.md и
// openspec/specs/barcode-collection-session/spec.md.

#Область ОбработчикиМетодовHTTP

Функция BarcodeResolve(Запрос)

	Попытка

		ДанныеЗапроса = ПрочитатьДанныеЗапроса(Запрос);
		Штрихкод = ШтрихкодИзДанныхЗапроса(ДанныеЗапроса);

		Если Штрихкод = "" Тогда
			Возврат ОтветJSON(400, Новый Структура("error,message", "invalid_request", "Не указан или некорректен штрихкод."));
		КонецЕсли;

		МаксимальнаяДлинаШтрихкода = 200;
		Если СтрДлина(Штрихкод) > МаксимальнаяДлинаШтрихкода Тогда
			Возврат ОтветJSON(400, Новый Структура("error,message", "invalid_request", "Штрихкод длиннее 200 символов."));
		КонецЕсли;

		Совпадения = СовпаденияПоШтрихкоду(Штрихкод);

		Если Совпадения.Количество() = 0 Тогда
			Возврат ОтветJSON(200, ОтветПоиска("not_found", Штрихкод, Совпадения, "Номенклатура не найдена."));
		КонецЕсли;

		Если Совпадения.Количество() > 1 Тогда
			Возврат ОтветJSON(200, ОтветПоиска("ambiguous", Штрихкод, Совпадения, "Найдено несколько позиций."));
		КонецЕсли;

		Возврат ОтветJSON(200, ОтветПоиска("found", Штрихкод, Совпадения));

	Исключение

		Возврат ОтветJSON(500, Новый Структура("error,message", "server_error", "Ошибка сервера."));

	КонецПопытки;

КонецФункции

// Принимает завершенную сессию сбора штрихкодов.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - входящий HTTP-запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - результат приема сессии.
//
Функция BarcodeCollectionSessionsSubmit(Запрос)

	Попытка

		ДанныеЗапроса = ПрочитатьДанныеЗапроса(Запрос);
		РезультатПроверки = ПроверитьДанныеСессии(ДанныеЗапроса);

		Если НЕ РезультатПроверки.ПроверкаПройдена Тогда
			Возврат ОтветJSON(
				400,
				Новый Структура("error,message", "invalid_request", "Некорректный запрос."));
		КонецЕсли;

		РезультатПриема = ПринятьСессию(
			РезультатПроверки.КлючСессии,
			РезультатПроверки.Строки);

		Если РезультатПриема.Статус = "warehouse_not_configured" Тогда
			Возврат ОтветJSON(
				409,
				Новый Структура(
					"error,message",
					"warehouse_not_configured",
					"Склад Barcode TSD не настроен."));
		КонецЕсли;

		Если РезультатПриема.Статус = "idempotency_conflict" Тогда
			Возврат ОтветJSON(
				409,
				Новый Структура(
					"error,message",
					"idempotency_conflict",
					"Сессия уже принята с другими данными."));
		КонецЕсли;

		ТелоОтвета = Новый Структура(
			"status,sessionId,documentRef",
			"accepted",
			РезультатПроверки.ИдентификаторСессии,
			Строка(РезультатПриема.Документ.УникальныйИдентификатор()));

		Возврат ОтветJSON(200, ТелоОтвета);

	Исключение

		Возврат ОтветJSON(
			500,
			Новый Структура("error,message", "server_error", "Ошибка сервера."));

	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьДанныеЗапроса(Запрос)

	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Если СокрЛП(ТелоЗапроса) = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЧтениеJSON = Неопределено;
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Если ЧтениеJSON <> Неопределено Тогда
			ЧтениеJSON.Закрыть();
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;

	Возврат ДанныеЗапроса;

КонецФункции

Функция ПроверитьДанныеСессии(ДанныеЗапроса)

	Результат = Новый Структура(
		"ПроверкаПройдена,ИдентификаторСессии,КлючСессии,Строки",
		Ложь,
		"",
		"",
		Неопределено);

	Если НЕ СтруктураИмеетТочныйСостав(ДанныеЗапроса, "sessionId", "lines") Тогда
		Возврат Результат;
	КонецЕсли;

	ИдентификаторСессии = Неопределено;
	СтрокиЗапроса = Неопределено;
	ДанныеЗапроса.Свойство("sessionId", ИдентификаторСессии);
	ДанныеЗапроса.Свойство("lines", СтрокиЗапроса);

	УникальныйИдентификаторСессии = УникальныйИдентификаторИзСтроки(ИдентификаторСессии);
	Если УникальныйИдентификаторСессии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	СтрокиСессии = СтрокиСессииИзДанных(СтрокиЗапроса);
	Если СтрокиСессии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.ПроверкаПройдена = Истина;
	Результат.ИдентификаторСессии = ИдентификаторСессии;
	Результат.КлючСессии = Строка(УникальныйИдентификаторСессии);
	Результат.Строки = СтрокиСессии;

	Возврат Результат;

КонецФункции

Функция СтрокиСессииИзДанных(СтрокиЗапроса)

	Если ТипЗнч(СтрокиЗапроса) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;

	МаксимальноеКоличествоСтрок = 1000;
	Если СтрокиЗапроса.Количество() = 0
	 Или СтрокиЗапроса.Количество() > МаксимальноеКоличествоСтрок Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИндексНоменклатуры = Новый Соответствие;
	НоменклатураДляПроверки = Новый Массив;
	СтрокиСессии = Новый Массив;

	Для Каждого ДанныеСтроки Из СтрокиЗапроса Цикл
		СтрокаСессии = СтрокаСессииИзДанных(ДанныеСтроки);
		Если СтрокаСессии = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;

		Если ИндексНоменклатуры.Получить(СтрокаСессии.Номенклатура) <> Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;

		ИндексНоменклатуры.Вставить(СтрокаСессии.Номенклатура, Истина);
		НоменклатураДляПроверки.Добавить(СтрокаСессии.Номенклатура);
		СтрокиСессии.Добавить(СтрокаСессии);
	КонецЦикла;

	Если НЕ СуществуютВсеТовары(НоменклатураДляПроверки) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат СтрокиСессии;

КонецФункции

Функция СтрокаСессииИзДанных(ДанныеСтроки)

	Если НЕ СтруктураИмеетТочныйСостав(
		ДанныеСтроки,
		"itemRef",
		"barcode",
		"quantity") Тогда

		Возврат Неопределено;
	КонецЕсли;

	ИдентификаторНоменклатуры = Неопределено;
	Штрихкод = Неопределено;
	Количество = Неопределено;
	ДанныеСтроки.Свойство("itemRef", ИдентификаторНоменклатуры);
	ДанныеСтроки.Свойство("barcode", Штрихкод);
	ДанныеСтроки.Свойство("quantity", Количество);

	УникальныйИдентификаторНоменклатуры = УникальныйИдентификаторИзСтроки(
		ИдентификаторНоменклатуры);
	Если УникальныйИдентификаторНоменклатуры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(
		УникальныйИдентификаторНоменклатуры);

	Если ТипЗнч(Штрихкод) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	МаксимальнаяДлинаШтрихкода = 200;
	Если СтрДлина(Штрихкод) = 0
	 Или СтрДлина(Штрихкод) > МаксимальнаяДлинаШтрихкода Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТипЗнч(Количество) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;

	МаксимальноеКоличество = 999999999999.999;
	ТочностьКоличества = 3;
	Если Количество <= 0
	 Или Количество > МаксимальноеКоличество
	 Или Окр(Количество, ТочностьКоличества) <> Количество Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура(
		"Номенклатура,Штрихкод,Количество",
		Номенклатура,
		Штрихкод,
		Количество);

КонецФункции

Функция СтруктураИмеетТочныйСостав(
	Значение,
	ПервоеСвойство,
	ВтороеСвойство,
	ТретьеСвойство = Неопределено)

	Если ТипЗнч(Значение) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	ОжидаемоеКоличество = 2;
	Если ТретьеСвойство <> Неопределено Тогда
		ОжидаемоеКоличество = 3;
	КонецЕсли;

	Если Значение.Количество() <> ОжидаемоеКоличество Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ЭлементСтруктуры Из Значение Цикл
		ИмяСвойства = ЭлементСтруктуры.Ключ;
		Если СтрСравнить(ИмяСвойства, ПервоеСвойство) = 0
		 Или СтрСравнить(ИмяСвойства, ВтороеСвойство) = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если ТретьеСвойство <> Неопределено Тогда
			Если СтрСравнить(ИмяСвойства, ТретьеСвойство) = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		Возврат Ложь;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция УникальныйИдентификаторИзСтроки(Значение)

	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДлинаУникальногоИдентификатора = 36;
	Если СтрДлина(Значение) <> ДлинаУникальногоИдентификатора Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Идентификатор = Новый УникальныйИдентификатор(Значение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Если НРег(Строка(Идентификатор)) <> НРег(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Идентификатор;

КонецФункции

Функция СуществуютВсеТовары(НоменклатураДляПроверки)

	ЗапросПроверки = Новый Запрос;
	ЗапросПроверки.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&НоменклатураДляПроверки)
	|	И НЕ Номенклатура.ЭтоГруппа";

	ЗапросПроверки.УстановитьПараметр(
		"НоменклатураДляПроверки",
		НоменклатураДляПроверки);

	РезультатЗапроса = ЗапросПроверки.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоНайденных = 0;

	Пока Выборка.Следующий() Цикл
		КоличествоНайденных = КоличествоНайденных + 1;
	КонецЦикла;

	Возврат КоличествоНайденных = НоменклатураДляПроверки.Количество();

КонецФункции

// Принимает новую сессию или сверяет повтор под блокировкой ключа идемпотентности.
//
// На повторе константа склада не читается: результат зависит только от
// зарегистрированного документа и валидированного набора строк.
//
Функция ПринятьСессию(КлючСессии, СтрокиСессии)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"РегистрСведений.BarcodeTSD_ПринятыеСессии");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторСессии", КлючСессии);

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.BarcodeTSD_ПринятыеСессии.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторСессии = КлючСессии;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			Если ДанныеДокументаСовпадают(МенеджерЗаписи.Документ, СтрокиСессии) Тогда
				Результат = Новый Структура(
					"Статус,Документ",
					"accepted",
					МенеджерЗаписи.Документ);
			Иначе
				Результат = Новый Структура(
					"Статус,Документ",
					"idempotency_conflict",
					Неопределено);
			КонецЕсли;
		Иначе
			Склад = Константы.BarcodeTSD_Склад.Получить();
			Если НЕ СкладНастроен(Склад) Тогда
				Результат = Новый Структура(
					"Статус,Документ",
					"warehouse_not_configured",
					Неопределено);
			Иначе
				ДокументСсылка = СоздатьДокументСессии(
					КлючСессии,
					Склад,
					СтрокиСессии);

				МенеджерЗаписи.Документ = ДокументСсылка;
				МенеджерЗаписи.Записать();

				Результат = Новый Структура(
					"Статус,Документ",
					"accepted",
					ДокументСсылка);
			КонецЕсли;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция СкладНастроен(Склад)

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗапросПроверки = Новый Запрос;
	ЗапросПроверки.Текст =
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Склад
	|	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = &ТипСтруктурнойЕдиницы";

	ЗапросПроверки.УстановитьПараметр("Склад", Склад);
	ЗапросПроверки.УстановитьПараметр(
		"ТипСтруктурнойЕдиницы",
		Перечисления.ТипыСтруктурныхЕдиниц.Склад);

	РезультатЗапроса = ЗапросПроверки.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

Функция СоздатьДокументСессии(КлючСессии, Склад, СтрокиСессии)

	ДокументОбъект = Документы.BarcodeTSD_СборШтрихкодов.СоздатьДокумент();
	ДокументОбъект.Номер = КлючСессии;
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Склад = Склад;

	Для Каждого СтрокаСессии Из СтрокиСессии Цикл
		СтрокаДокумента = ДокументОбъект.Товары.Добавить();
		СтрокаДокумента.Номенклатура = СтрокаСессии.Номенклатура;
		СтрокаДокумента.Штрихкод = СтрокаСессии.Штрихкод;
		СтрокаДокумента.Количество = СтрокаСессии.Количество;
	КонецЦикла;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

	Возврат ДокументОбъект.Ссылка;

КонецФункции

// Сравнивает строки семантически, без учета их порядка.
//
Функция ДанныеДокументаСовпадают(ДокументСсылка, СтрокиСессии)

	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	Если ДокументОбъект.Товары.Количество() <> СтрокиСессии.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;

	СтрокиПоНоменклатуре = Новый Соответствие;
	Для Каждого СтрокаСессии Из СтрокиСессии Цикл
		СтрокиПоНоменклатуре.Вставить(СтрокаСессии.Номенклатура, СтрокаСессии);
	КонецЦикла;

	Для Каждого СтрокаДокумента Из ДокументОбъект.Товары Цикл
		СтрокаСессии = СтрокиПоНоменклатуре.Получить(СтрокаДокумента.Номенклатура);
		Если СтрокаСессии = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

		Если СтрСравнить(СтрокаДокумента.Штрихкод, СтрокаСессии.Штрихкод) <> 0
		 Или СтрокаДокумента.Количество <> СтрокаСессии.Количество Тогда
			Возврат Ложь;
		КонецЕсли;

		СтрокиПоНоменклатуре.Удалить(СтрокаДокумента.Номенклатура);
	КонецЦикла;

	Возврат СтрокиПоНоменклатуре.Количество() = 0;

КонецФункции

Функция ШтрихкодИзДанныхЗапроса(ДанныеЗапроса)

	Если ТипЗнч(ДанныеЗапроса) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;

	Если ДанныеЗапроса.Количество() <> 1 Тогда
		Возврат "";
	КонецЕсли;

	Штрихкод = "";
	Если НЕ ДанныеЗапроса.Свойство("barcode", Штрихкод) Тогда
		Возврат "";
	КонецЕсли;

	Если ТипЗнч(Штрихкод) <> Тип("Строка") Тогда
		Возврат "";
	КонецЕсли;

	Возврат СокрЛП(Штрихкод);

КонецФункции

Функция СовпаденияПоШтрихкоду(Штрихкод)

	ЗапросПоиска = Новый Запрос;
	ЗапросПоиска.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|	И ШтрихкодыНоменклатуры.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

	ЗапросПоиска.УстановитьПараметр("Штрихкод", Штрихкод);

	РезультатЗапроса = ЗапросПоиска.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Совпадения = Новый Массив;

	Пока Выборка.Следующий() Цикл
		Совпадения.Добавить(
			Новый Структура(
				"itemRef,name",
				Строка(Выборка.Номенклатура.УникальныйИдентификатор()),
				Выборка.Наименование));
	КонецЦикла;

	Возврат Совпадения;

КонецФункции

Функция ОтветПоиска(Статус, Штрихкод, Совпадения, Сообщение = "")

	Ответ = Новый Структура("status,barcode,matches", Статус, Штрихкод, Совпадения);
	Если Сообщение <> "" Тогда
		Ответ.Вставить("message", Сообщение);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

Функция ОтветJSON(КодСостояния, ТелоОтвета)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, ТелоОтвета);
	СтрокаОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);

	Возврат Ответ;

КонецФункции

#КонецОбласти
